/**
  *************************************************************************************
  * @file    SystemConfig.c
  * @author  ZH
  * @version V1.0.0
  * @date    2014年9月10日
  * @brief   SystemConfig模块源文件
  *************************************************************************************
  */
#include "includes.h"



/**
  *************************************************************************************
  * @brief  系统配置
  * @param  无
  * @retval 无
  * @author ZH
  * @date   2014年9月10日
  * @note   无
  *************************************************************************************  
  */
void SystemGpioConfig(void)
{
	//滴答定时器配置
	SysTickConfig();//中断一次	
	LEDConfig();
//	UartConfig();	
}
/**
  *************************************************************************************
  * @brief  硬件初始化
  * @param  无
  * @retval 无
  * @author ZH
  * @date   2014年9月10日
  * @note   无
  *************************************************************************************  
  */
ErrorStatus SystemHardwareInit(void)
{

//	while(SPIRead(0x01) == 0x89);
	return SUCCESS;		
}



